MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ256GP506/mcu.h
#define _C1INTF_WAKIF_POSITION                   0x00000006
#define _C1INTF_WAKIF_MASK                       0x00000040
#define _C1INTF_WAKIF_LENGTH                     0x00000001

#define _C1INTF_IVRIF_POSITION                   0x00000007
#define _C1INTF_IVRIF_MASK                       0x00000080
#define _C1INTF_IVRIF_LENGTH                     0x00000001

#define _C1INTF_EWARN_POSITION                   0x00000008
#define _C1INTF_EWARN_MASK                       0x00000100
#define _C1INTF_EWARN_LENGTH                     0x00000001

#define _C1INTF_RXWAR_POSITION                   0x00000009
#define _C1INTF_RXWAR_MASK                       0x00000200
#define _C1INTF_RXWAR_LENGTH                     0x00000001

#define _C1INTF_TXWAR_POSITION                   0x0000000A
#define _C1INTF_TXWAR_MASK                       0x00000400
#define _C1INTF_TXWAR_LENGTH                     0x00000001

#define _C1INTF_RXBP_POSITION                    0x0000000B
#define _C1INTF_RXBP_MASK                        0x00000800
#define _C1INTF_RXBP_LENGTH                      0x00000001

#define _C1INTF_TXBP_POSITION                    0x0000000C
#define _C1INTF_TXBP_MASK                        0x00001000
#define _C1INTF_TXBP_LENGTH                      0x00000001

#define _C1INTF_TXBO_POSITION                    0x0000000D
#define _C1INTF_TXBO_MASK                        0x00002000
#define _C1INTF_TXBO_LENGTH                      0x00000001

#define _C1INTE_TBIE_POSITION                    0x00000000
#define _C1INTE_TBIE_MASK                        0x00000001
#define _C1INTE_TBIE_LENGTH                      0x00000001

#define _C1INTE_RBIE_POSITION                    0x00000001
#define _C1INTE_RBIE_MASK                        0x00000002
#define _C1INTE_RBIE_LENGTH                      0x00000001

#define _C1INTE_RBOVIE_POSITION                  0x00000002
#define _C1INTE_RBOVIE_MASK                      0x00000004
#define _C1INTE_RBOVIE_LENGTH                    0x00000001

#define _C1INTE_FIFOIE_POSITION                  0x00000003
#define _C1INTE_FIFOIE_MASK                      0x00000008
#define _C1INTE_FIFOIE_LENGTH                    0x00000001

#define _C1INTE_ERRIE_POSITION                   0x00000005
#define _C1INTE_ERRIE_MASK                       0x00000020
#define _C1INTE_ERRIE_LENGTH                     0x00000001

#define _C1INTE_WAKIE_POSITION                   0x00000006
#define _C1INTE_WAKIE_MASK                       0x00000040
#define _C1INTE_WAKIE_LENGTH                     0x00000001

#define _C1INTE_IVRIE_POSITION                   0x00000007
#define _C1INTE_IVRIE_MASK                       0x00000080
#define _C1INTE_IVRIE_LENGTH                     0x00000001

#define _C1EC_RERRCNT_POSITION                   0x00000000
#define _C1EC_RERRCNT_MASK                       0x000000FF
#define _C1EC_RERRCNT_LENGTH                     0x00000008

#define _C1EC_TERRCNT_POSITION                   0x00000008
#define _C1EC_TERRCNT_MASK                       0x0000FF00
#define _C1EC_TERRCNT_LENGTH                     0x00000008

#define _C1EC_RERRCNT0_POSITION                  0x00000000
#define _C1EC_RERRCNT0_MASK                      0x00000001
#define _C1EC_RERRCNT0_LENGTH                    0x00000001

#define _C1EC_RERRCNT1_POSITION                  0x00000001
#define _C1EC_RERRCNT1_MASK                      0x00000002
#define _C1EC_RERRCNT1_LENGTH                    0x00000001

#define _C1EC_RERRCNT2_POSITION                  0x00000002
#define _C1EC_RERRCNT2_MASK                      0x00000004
#define _C1EC_RERRCNT2_LENGTH                    0x00000001

#define _C1EC_RERRCNT3_POSITION                  0x00000003
#define _C1EC_RERRCNT3_MASK                      0x00000008
#define _C1EC_RERRCNT3_LENGTH                    0x00000001

#define _C1EC_RERRCNT4_POSITION                  0x00000004
#define _C1EC_RERRCNT4_MASK                      0x00000010
#define _C1EC_RERRCNT4_LENGTH                    0x00000001

#define _C1EC_RERRCNT5_POSITION                  0x00000005
#define _C1EC_RERRCNT5_MASK                      0x00000020
#define _C1EC_RERRCNT5_LENGTH                    0x00000001

#define _C1EC_RERRCNT6_POSITION                  0x00000006
#define _C1EC_RERRCNT6_MASK                      0x00000040
#define _C1EC_RERRCNT6_LENGTH                    0x00000001

#define _C1EC_RERRCNT7_POSITION                  0x00000007
#define _C1EC_RERRCNT7_MASK                      0x00000080
#define _C1EC_RERRCNT7_LENGTH                    0x00000001

#define _C1EC_TERRCNT0_POSITION                  0x00000008
#define _C1EC_TERRCNT0_MASK                      0x00000100
#define _C1EC_TERRCNT0_LENGTH                    0x00000001

#define _C1EC_TERRCNT1_POSITION                  0x00000009
#define _C1EC_TERRCNT1_MASK                      0x00000200
#define _C1EC_TERRCNT1_LENGTH                    0x00000001

#define _C1EC_TERRCNT2_POSITION                  0x0000000A
#define _C1EC_TERRCNT2_MASK                      0x00000400
#define _C1EC_TERRCNT2_LENGTH                    0x00000001

#define _C1EC_TERRCNT3_POSITION                  0x0000000B
#define _C1EC_TERRCNT3_MASK                      0x00000800
#define _C1EC_TERRCNT3_LENGTH                    0x00000001

#define _C1EC_TERRCNT4_POSITION                  0x0000000C
#define _C1EC_TERRCNT4_MASK                      0x00001000
#define _C1EC_TERRCNT4_LENGTH                    0x00000001

#define _C1EC_TERRCNT5_POSITION                  0x0000000D
#define _C1EC_TERRCNT5_MASK                      0x00002000
#define _C1EC_TERRCNT5_LENGTH                    0x00000001

#define _C1EC_TERRCNT6_POSITION                  0x0000000E
#define _C1EC_TERRCNT6_MASK                      0x00004000
#define _C1EC_TERRCNT6_LENGTH                    0x00000001

#define _C1EC_TERRCNT7_POSITION                  0x0000000F
#define _C1EC_TERRCNT7_MASK                      0x00008000
#define _C1EC_TERRCNT7_LENGTH                    0x00000001

#define _C1CFG1_BRP_POSITION                     0x00000000
#define _C1CFG1_BRP_MASK                         0x0000003F
#define _C1CFG1_BRP_LENGTH                       0x00000006

#define _C1CFG1_SJW_POSITION                     0x00000006
#define _C1CFG1_SJW_MASK                         0x000000C0
#define _C1CFG1_SJW_LENGTH                       0x00000002

#define _C1CFG1_BRP0_POSITION                    0x00000000
#define _C1CFG1_BRP0_MASK                        0x00000001
#define _C1CFG1_BRP0_LENGTH                      0x00000001

#define _C1CFG1_BRP1_POSITION                    0x00000001
#define _C1CFG1_BRP1_MASK                        0x00000002
#define _C1CFG1_BRP1_LENGTH                      0x00000001

